Revit 2027 API
FabricationConfiguration.DamperExists Method
 Checks to see if the specified damper exists.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool DamperExists(
	int damperId
)
Public Function DamperExists (
	damperId As Integer
) As Boolean
public:
bool DamperExists(
	int damperId
)
member DamperExists :
        damperId : int -> bool
Parameters
damperId Int32
 The damper identifier to check.
Return Value
Boolean
 Returns true if the damper exists.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace